In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
ser1 = Series([np.nan,1,2,3,np.nan],
             index= ['sat1','sat2','sat3','sat4','sat5'])

In [3]:
ser1

sat1    NaN
sat2    1.0
sat3    2.0
sat4    3.0
sat5    NaN
dtype: float64

In [4]:
ser1.isnull()

sat1     True
sat2    False
sat3    False
sat4    False
sat5     True
dtype: bool

In [5]:
ser1[ser1.isnull()]

sat1   NaN
sat5   NaN
dtype: float64

In [6]:
ser1.isnull().sum()

2

In [7]:
ser1.dropna()

sat2    1.0
sat3    2.0
sat4    3.0
dtype: float64

In [8]:
npn = np.nan
df = DataFrame([[1,npn,3],[4,5,npn],[8,7,9],[npn,npn,npn]])
df

     0    1    2
0  1.0  NaN  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0
3  NaN  NaN  NaN

In [11]:
df.isnull().sum().sum()

5

In [13]:
df.dropna(axis=0,how='any')

     0    1    2
2  8.0  7.0  9.0

In [14]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [15]:
df

     0    1    2
0  1.0  NaN  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0
3  NaN  NaN  NaN

In [17]:
df.dropna(thresh=3) #en az 3 elemanı nan olmayan satırlar kalıcak.

     0    1    2
2  8.0  7.0  9.0

In [18]:
df.dropna(thresh=2)

     0    1    2
0  1.0  NaN  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0

In [19]:
df

     0    1    2
0  1.0  NaN  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0
3  NaN  NaN  NaN

In [20]:
df.dropna(thresh=2,inplace=True) #3.satır silindi

In [21]:
df

     0    1    2
0  1.0  NaN  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0

In [24]:
df.fillna(value='dolan')

     0      1      2
0  1.0  dolan      3
1  4.0      5  dolan
2  8.0      7      9

In [25]:
df.fillna(value=df.mean()) #boslukları ortalama ile doldurduk

     0    1    2
0  1.0  6.0  3.0
1  4.0  5.0  6.0
2  8.0  7.0  9.0

In [26]:
df

     0    1    2
0  1.0  NaN  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0

In [27]:
df[1].fillna(value=df[1].mean(),inplace=True)

In [28]:
df

     0    1    2
0  1.0  6.0  3.0
1  4.0  5.0  NaN
2  8.0  7.0  9.0